Examinator/src/InformationRegisters/НовостиСУО/НовостиСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НовостиСУО</name>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Выделить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрепить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/НовостиСУО/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция Новости(Знач Пользователь = Неопределено, Знач ВсеНовости = Истина, Знач ДоДаты = Неопределено) Экспорт

	// Устанавливаем переменные
	
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	ТекущаяДата = ТекущаяДатаСеанса();
	
	Если ДоДаты = Неопределено Тогда
		ДоДаты = ДобавитьМесяц(ТекущаяДата, -1); 
	КонецЕсли;	
	
	// Получаем данные
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РегистрСведенийНовостиСУО.Регистратор КАК Новость,
		|	РегистрСведенийНовостиСУО.Дата КАК ДатаПубликации,
		|	РегистрСведенийНовостиСУО.Заголовок,
		|	РегистрСведенийНовостиСУО.Выделить,
		|	ВЫБОР
		|		КОГДА &ВсеНовости
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ РегистрСведенийНовостиСУО.Закрепить
		|	КОНЕЦ КАК Закрепить
		|ИЗ
		|	РегистрСведений.НовостиСУО КАК РегистрСведенийНовостиСУО
		|ГДЕ
		|	РегистрСведенийНовостиСУО.Дата <= &ТекущаяДата
		|	И (РегистрСведенийНовостиСУО.Дата >= &ТекущаяДатаМинусМесяц
		|			ИЛИ &ВсеНовости)
		|	И (РегистрСведенийНовостиСУО.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|			ИЛИ РегистрСведенийНовостиСУО.Пользователь = &ТекущийПользователь)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаПубликации УБЫВ";

	Запрос.УстановитьПараметр("ВсеНовости", ВсеНовости);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата);
	Запрос.УстановитьПараметр("ТекущаяДатаМинусМесяц", ДоДаты);
	Запрос.УстановитьПараметр("ТекущийПользователь", Пользователь);

	РезультатЗапроса = Запрос.Выполнить();

	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

Функция КоличествоНовостейЗаПериод(Пользователь, ДатаНачала, ДатаОкончания) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Пользователь)
		ИЛИ НЕ ЗначениеЗаполнено(ДатаНачала)
		ИЛИ НЕ ЗначениеЗаполнено(ДатаОкончания) Тогда
		
		Возврат 0;
		
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НовостиСУО.Регистратор КАК Новость
		|ИЗ
		|	РегистрСведений.НовостиСУО КАК НовостиСУО
		|ГДЕ
		|	НовостиСУО.Дата >= &ДатаНачала
		|	И НовостиСУО.Дата <= &ДатаОкончания
		|	И (НовостиСУО.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|			ИЛИ НовостиСУО.Пользователь = &ТекущийПользователь)";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("ТекущийПользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Возврат ВыборкаДетальныеЗаписи.Количество();	
	
КонецФункции

#КонецЕсли
